flashsim_result/sysbench/ctoc/nontrx_update_nokey_t60.out
2018. 12. 17. (월) 05:08:21 KST
[SYSBENCH] Running benchmark...
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16

Doing OLTP test.
Running non-transactional test
Using Uniform distribution
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 15 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            0
        write:                           606156
        other:                           0
        total:                           606156
    transactions:                        606156 (10100.75 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 606156 (10100.75 per sec.)
    other operations:                    0      (0.00 per sec.)

Test execution summary:
    total time:                          60.0110s
    total number of events:              606156
    total time taken by event execution: 959.6378
    per-request statistics:
         min:                                  0.09ms
         avg:                                  1.58ms
         max:                                 84.74ms
         approx.  95 percentile:               4.91ms

Threads fairness:
    events (avg/stddev):           37884.7500/62.62
    execution time (avg/stddev):   59.9774/0.00

2018. 12. 17. (월) 05:09:21 KST

----------------------------------------------------------------------------


mutex_t : 0x3be69ea8 q:0x3be69ea0, size:2048
mutex_t : 0x3be6a478 q:0x3be6a470, size:1024
mutex_t : 0x3be6a4d8 q:0x3be6a4d0, size:1024
mutex_t : 0x3be6a538 q:0x3be6a530, size:1024
nohost: [dm_nohost_probe] PROBE STARTED
Initializing Connectal & DMA...
subprocess pid 11472 completed status=0 0
[initPortalHardwareOnce:270] fd 5 len 0
[checkSignature:167] read status from '/dev/connectal' was only 0 bytes long
checkSignature: driver 'zynqportal.c' signature mismatch 3431c6f01fcc1c478c8187d1e6992edc e059016ac411386d6e2597d43bc49e15
checkSignature: driver 'portalmem.c' signature mismatch 0ba7c77e370fade81cfa5a0e5abb92f0 eef0fb3bacb31283d694f7aef3d380b3
Main::allocating memory...
USE_ACP = FALSE
USE_ACP = FALSE
Main::allocating memory finished!
[dmaManagerOnce:44]
Requested FCLK[0]=200000000 actually 200000000
Requested Freq: 200.00, Actual Freq: 200.00, status=0
LOG: DEBUG DUMP: gearSend = -547331886, gearRec = -276029697, aurSend = -1971391967, aurRec = -1969897597, readSend=2045855816, writeSend=817707764
nohost: [dm_nohost_probe] PROBE DONE!
nohost: [dm_nohost_open] open done!
!!! print info !!!
Async status: 1
use wirte buffer: 1
Wait same mapping request(FLYING): 0
use gc polling: 0
use eviction polling: 0
# of total block: 512
# of total page: 8388608
page per block: 16384
# of translation block: 2
# of translation page: 32768
# of data block: 508
# of data page: 8323072
# of total cache mapping entry: 4096
max # of ram reside cme: 1024
max # of clean translation cache table: 512
cache percentage: 25.000%
!!! print info !!!
BM_Init() End!
mutex_t : 0x3be8a378 q:0x3be8a370, size:1024
_nos:512
bad_block_checking...[ 99.998474 ]
badblock_cnt: 90
_RNOS:4096
bad block 294912 -> 67092480
bad block 737280 -> 67076096
bad block 770048 -> 67059712
bad block 802816 -> 67043328
bad block 835584 -> 67026944
bad block 1474560 -> 67010560
bad block 1490944 -> 66994176
bad block 1884160 -> 66977792
bad block 2359296 -> 66961408
bad block 4620288 -> 66945024
bad block 5783552 -> 66928640
bad block 5931008 -> 66912256
bad block 6520832 -> 66895872
bad block 6619136 -> 66879488
bad block 8896512 -> 66863104
bad block 9060352 -> 66846720
bad block 9191424 -> 66830336
bad block 11255808 -> 66813952
bad block 12763136 -> 66797568
bad block 13467648 -> 66781184
bad block 13533184 -> 66764800
checking done!
server waiting.....
connected!!!

WAF: 1.36

WAF: 1.38

WAF: 1.40

WAF: 1.40

WAF: 1.40

WAF: 1.40

WAF: 1.40

WAF: 1.41

WAF: 1.41

WAF: 1.41

WAF: 1.41

WAF: 1.41
^C


[cdf]read---
60	2	0.000002
90	1	0.000002
120	1754	0.001462
130	23440	0.020965
140	46439	0.059603
150	37159	0.090521
160	33705	0.118564
170	38226	0.150369
180	37522	0.181589
190	31162	0.207517
200	24949	0.228275
210	21949	0.246537
220	20609	0.263684
230	18316	0.278924
240	16021	0.292254
250	13264	0.303290
260	12245	0.313478
270	19140	0.329403
280	29614	0.354043
290	39302	0.386743
300	47916	0.426611
310	50656	0.468758
320	49385	0.509848
330	49320	0.550884
340	52432	0.594509
350	53337	0.638887
360	49495	0.680068
370	44038	0.716709
380	39871	0.749883
390	37559	0.781133
400	35978	0.811068
410	31627	0.837382
420	27207	0.860019
430	23424	0.879509
440	20546	0.896604
450	18085	0.911651
460	16020	0.924980
470	13457	0.936177
480	11392	0.945655
490	9772	0.953786
500	8330	0.960717
510	7089	0.966615
520	5981	0.971591
530	4999	0.975751
540	4087	0.979151
550	3615	0.982159
560	3083	0.984724
570	2583	0.986873
580	2133	0.988648
590	1888	0.990219
600	1512	0.991477
610	1298	0.992557
620	1101	0.993473
630	897	0.994219
640	670	0.994776
650	680	0.995342
660	549	0.995799
670	441	0.996166
680	405	0.996503
690	305	0.996757
700	283	0.996992
710	217	0.997173
720	196	0.997336
730	167	0.997475
740	150	0.997600
750	108	0.997689
760	99	0.997772
770	77	0.997836
780	82	0.997904
790	58	0.997952
800	47	0.997992
810	25	0.998012
820	42	0.998047
830	32	0.998074
840	25	0.998095
850	20	0.998111
860	17	0.998125
870	20	0.998142
880	23	0.998161
890	27	0.998184
900	10	0.998192
910	17	0.998206
920	14	0.998218
930	7	0.998224
940	12	0.998234
950	7	0.998239
960	10	0.998248
970	4	0.998251
980	9	0.998259
990	9	0.998266
1000	8	0.998273
1010	11	0.998282
1020	2	0.998284
1030	6	0.998289
1040	3	0.998291
1050	7	0.998297
1060	6	0.998302
1070	5	0.998306
1080	5	0.998310
1090	13	0.998321
1100	4	0.998324
1110	10	0.998333
1120	11	0.998342
1130	7	0.998348
1140	6	0.998353
1150	6	0.998358
1160	16	0.998371
1170	7	0.998377
1180	11	0.998386
1190	11	0.998395
1200	7	0.998401
1210	11	0.998410
1220	5	0.998414
1230	8	0.998421
1240	6	0.998426
1250	5	0.998430
1260	7	0.998436
1270	8	0.998442
1280	7	0.998448
1290	12	0.998458
1300	10	0.998467
1310	9	0.998474
1320	4	0.998477
1330	5	0.998482
1340	2	0.998483
1350	8	0.998490
1360	4	0.998493
1370	2	0.998495
1380	6	0.998500
1390	7	0.998506
1400	5	0.998510
1410	6	0.998515
1420	11	0.998524
1430	6	0.998529
1440	7	0.998535
1450	8	0.998541
1460	8	0.998548
1470	7	0.998554
1480	6	0.998559
1490	5	0.998563
1500	5	0.998567
1510	6	0.998572
1520	2	0.998574
1530	7	0.998580
1540	4	0.998583
1550	8	0.998590
1560	10	0.998598
1570	4	0.998601
1580	5	0.998605
1590	2	0.998607
1600	4	0.998610
1610	7	0.998616
1620	2	0.998618
1630	8	0.998625
1640	8	0.998631
1650	5	0.998635
1660	3	0.998638
1670	3	0.998640
1680	10	0.998649
1690	4	0.998652
1710	3	0.998655
1720	1	0.998655
1730	5	0.998660
1740	1	0.998660
1750	4	0.998664
1760	5	0.998668
1770	2	0.998670
1780	2	0.998671
1790	3	0.998674
1800	2	0.998675
1810	4	0.998679
1820	7	0.998685
1830	2	0.998686
1840	4	0.998690
1850	7	0.998695
1860	6	0.998700
1870	4	0.998704
1880	3	0.998706
1890	3	0.998709
1900	2	0.998710
1910	3	0.998713
1920	4	0.998716
1930	4	0.998720
1940	4	0.998723
1950	8	0.998729
1960	2	0.998731
1970	2	0.998733
1980	4	0.998736
1990	2	0.998738
2000	6	0.998743
2010	4	0.998746
2020	6	0.998751
2030	4	0.998754
2040	3	0.998757
2050	2	0.998759
2060	7	0.998764
2070	7	0.998770
2080	5	0.998774
2090	1	0.998775
2100	3	0.998778
2110	7	0.998784
2120	1	0.998784
2130	11	0.998794
2140	4	0.998797
2150	1	0.998798
2160	3	0.998800
2170	9	0.998808
2180	6	0.998813
2190	6	0.998818
2200	9	0.998825
2210	4	0.998829
2220	6	0.998833
2230	10	0.998842
2240	4	0.998845
2250	4	0.998848
2260	4	0.998852
2270	5	0.998856
2280	9	0.998863
2290	5	0.998868
2300	5	0.998872
2310	7	0.998878
2320	2	0.998879
2330	1	0.998880
2340	2	0.998882
2350	1	0.998883
2360	2	0.998884
2370	5	0.998888
2380	1	0.998889
2390	6	0.998894
2400	3	0.998897
2410	1	0.998898
2420	3	0.998900
2430	7	0.998906
2440	3	0.998908
2450	1	0.998909
2460	4	0.998913
2470	8	0.998919
2480	6	0.998924
2500	2	0.998926
2510	4	0.998929
2530	2	0.998931
2540	7	0.998937
2550	2	0.998938
2560	6	0.998943
2570	7	0.998949
2580	2	0.998951
2600	2	0.998952
2610	8	0.998959
2620	6	0.998964
2630	5	0.998968
2640	7	0.998974
2650	2	0.998976
2660	6	0.998981
2670	5	0.998985
2680	2	0.998987
2690	2	0.998988
2700	3	0.998991
2710	6	0.998996
2720	1	0.998997
2730	5	0.999001
2740	2	0.999002
2750	3	0.999005
2760	6	0.999010
2770	3	0.999012
2780	5	0.999017
2790	7	0.999022
2800	11	0.999032
2810	8	0.999038
2820	7	0.999044
2830	4	0.999047
2840	7	0.999053
2850	10	0.999061
2860	7	0.999067
2870	6	0.999072
2880	4	0.999076
2890	11	0.999085
2900	7	0.999091
2910	7	0.999096
2920	7	0.999102
2930	3	0.999105
2940	8	0.999111
2950	5	0.999116
2960	8	0.999122
2970	12	0.999132
2980	2	0.999134
2990	1	0.999135
3000	4	0.999138
3010	5	0.999142
3020	6	0.999147
3030	3	0.999150
3040	6	0.999155
3050	4	0.999158
3060	3	0.999160
3070	4	0.999164
3080	5	0.999168
3090	8	0.999175
3100	5	0.999179
3110	7	0.999185
3120	5	0.999189
3130	5	0.999193
3140	8	0.999200
3150	5	0.999204
3160	6	0.999209
3170	7	0.999215
3180	2	0.999216
3190	2	0.999218
3200	7	0.999224
3210	6	0.999229
3220	2	0.999230
3230	5	0.999235
3240	5	0.999239
3250	4	0.999242
3260	3	0.999245
3270	2	0.999246
3280	1	0.999247
3290	2	0.999249
3300	6	0.999254
3310	2	0.999255
3330	1	0.999256
3340	2	0.999258
3350	1	0.999259
3380	2	0.999260
3390	2	0.999262
3400	5	0.999266
3410	1	0.999267
3420	5	0.999271
3430	4	0.999274
3440	5	0.999279
3450	5	0.999283
3460	7	0.999289
3470	2	0.999290
3480	4	0.999294
3490	10	0.999302
3500	3	0.999304
3510	5	0.999309
3520	3	0.999311
3530	9	0.999319
3540	9	0.999326
3550	6	0.999331
3560	1	0.999332
3570	6	0.999337
3580	4	0.999340
3590	6	0.999345
3600	1	0.999346
3610	4	0.999349
3620	5	0.999354
3630	10	0.999362
3640	5	0.999366
3650	4	0.999369
3660	7	0.999375
3670	2	0.999377
3680	4	0.999380
3690	4	0.999383
3700	1	0.999384
3720	4	0.999388
3730	4	0.999391
3740	5	0.999395
3750	7	0.999401
3760	4	0.999404
3770	3	0.999407
3790	5	0.999411
3800	10	0.999419
3810	2	0.999421
3820	4	0.999424
3830	5	0.999428
3840	1	0.999429
3850	1	0.999430
3860	2	0.999432
3870	3	0.999434
3880	3	0.999437
3890	1	0.999438
3900	2	0.999439
3910	2	0.999441
3920	3	0.999443
3930	1	0.999444
3940	5	0.999448
3950	7	0.999454
3960	3	0.999457
3970	7	0.999462
3980	3	0.999465
3990	2	0.999467
4000	1	0.999467
4010	2	0.999469
4020	1	0.999470
4030	6	0.999475
4050	7	0.999481
4060	2	0.999482
4070	9	0.999490
4080	3	0.999492
4090	5	0.999497
4100	5	0.999501
4110	2	0.999502
4120	3	0.999505
4130	2	0.999507
4140	5	0.999511
4150	5	0.999515
4160	4	0.999518
4170	4	0.999522
4180	2	0.999523
4190	4	0.999527
4200	5	0.999531
4210	11	0.999540
4220	2	0.999542
4230	9	0.999549
4240	3	0.999552
4250	9	0.999559
4260	6	0.999564
4270	10	0.999572
4280	3	0.999575
4290	6	0.999580
4300	9	0.999587
4310	6	0.999592
4320	7	0.999598
4330	10	0.999606
4340	10	0.999615
4350	8	0.999621
4360	8	0.999628
4370	1	0.999629
4380	5	0.999633
4390	2	0.999635
4400	4	0.999638
4420	4	0.999641
4430	6	0.999646
4440	8	0.999653
4450	4	0.999656
4460	4	0.999660
4470	5	0.999664
4480	2	0.999665
4490	7	0.999671
4510	4	0.999675
4520	7	0.999681
4530	7	0.999686
4540	5	0.999690
4550	5	0.999695
4560	5	0.999699
4570	5	0.999703
4580	1	0.999704
4590	2	0.999705
4600	7	0.999711
4610	4	0.999715
4620	5	0.999719
4630	3	0.999721
4640	5	0.999725
4650	2	0.999727
4660	3	0.999730
4670	2	0.999731
4680	3	0.999734
4690	2	0.999735
4700	2	0.999737
4710	1	0.999738
4720	4	0.999741
4730	6	0.999746
4740	4	0.999750
4750	3	0.999752
4760	2	0.999754
4770	3	0.999756
4780	5	0.999760
4790	8	0.999767
4800	3	0.999770
4810	3	0.999772
4820	4	0.999775
4830	2	0.999777
4840	2	0.999779
4850	2	0.999780
4860	1	0.999781
4880	1	0.999782
4890	3	0.999785
4900	1	0.999785
4940	1	0.999786
4960	1	0.999787
4980	1	0.999788
4990	1	0.999789
5000	1	0.999789
5010	3	0.999792
5020	2	0.999794
5040	3	0.999796
5080	1	0.999797
5100	2	0.999799
5110	2	0.999800
5120	2	0.999802
5140	2	0.999804
5160	3	0.999806
5170	1	0.999807
5200	2	0.999809
5210	1	0.999809
5260	1	0.999810
5280	1	0.999811
5380	1	0.999812
6010	2	0.999814
6020	2	0.999815
6050	2	0.999817
6100	1	0.999818
6110	1	0.999819
6130	3	0.999821
6140	3	0.999824
6150	4	0.999827
6160	3	0.999829
6170	3	0.999832
6180	2	0.999834
6190	3	0.999836
6200	1	0.999837
6210	2	0.999839
6220	1	0.999839
6230	1	0.999840
6250	1	0.999841
6260	5	0.999845
6270	1	0.999846
6280	2	0.999848
6290	2	0.999849
6300	2	0.999851
6340	1	0.999852
6350	2	0.999854
6360	1	0.999854
6370	1	0.999855
6380	1	0.999856
6390	2	0.999858
6400	2	0.999859
6430	2	0.999861
6450	1	0.999862
6460	1	0.999863
6510	1	0.999864
6790	2	0.999865
6990	1	0.999866
7000	1	0.999867
7050	1	0.999868
7100	2	0.999869
7120	3	0.999872
7160	2	0.999874
7170	1	0.999874
7190	3	0.999877
7200	9	0.999884
7210	2	0.999886
7220	2	0.999888
7230	1	0.999888
7270	1	0.999889
7360	2	0.999891
7370	2	0.999893
7390	1	0.999893
7400	1	0.999894
7410	1	0.999895
7420	2	0.999897
7430	1	0.999898
7440	3	0.999900
7460	1	0.999901
7480	2	0.999903
7500	1	0.999904
7540	3	0.999906
7580	2	0.999908
7620	1	0.999908
7630	1	0.999909
7650	3	0.999912
7670	2	0.999913
7680	3	0.999916
7700	2	0.999918
7720	2	0.999919
7770	2	0.999921
7780	1	0.999922
7820	1	0.999923
7830	2	0.999924
7840	1	0.999925
7860	1	0.999926
7870	2	0.999928
7880	2	0.999929
7890	3	0.999932
7910	5	0.999936
7920	1	0.999937
7930	1	0.999938
7990	1	0.999938
8000	2	0.999940
8060	3	0.999943
8070	1	0.999943
8080	2	0.999945
8090	1	0.999946
8110	3	0.999948
8130	3	0.999951
8170	2	0.999953
8220	2	0.999954
8230	3	0.999957
8310	1	0.999958
8320	3	0.999960
8330	1	0.999961
8340	1	0.999962
8350	2	0.999963
8460	1	0.999964
8470	1	0.999965
8490	2	0.999967
8500	2	0.999968
8510	1	0.999969
8520	1	0.999970
8550	4	0.999973
8580	3	0.999976
8590	1	0.999977
8610	1	0.999978
8620	1	0.999978
8630	1	0.999979
8660	1	0.999980
8670	2	0.999982
8700	1	0.999983
8720	2	0.999984
8740	1	0.999985
8760	2	0.999987
8920	1	0.999988
9600	1	0.999988
9780	1	0.999989
9900	1	0.999990
10750	1	0.999991
10850	1	0.999992
11460	1	0.999992
11640	1	0.999993
12200	1	0.999994
12220	1	0.999995
12570	1	0.999996
13610	1	0.999997
13830	1	0.999997
14340	1	0.999998
17050	1	0.999999
18300	1	1.000000
a_type	l_type	max	min	avg	cnt	percentage
0	0	98	0	8.500	28	0.00233%
1	0	8512	119	173.189	421375	35.05966%
2	0	18300	272	804.250	512	0.04260%
3	0	8685	148	355.877	387554	32.24565%
8	0	1	1	1.000	2	0.00017%
9	0	8454	119	167.129	392437	32.65193%
--------------------------------------------
|            bench type:                   |
--------------------------------------------
----algorithm----
[0~100(usec)]: 0
[100~200(usec)]: 0
[200~300(usec)]: 0
[300~400(usec)]: 0
[400~500(usec)]: 0
[500~600(usec)]: 0
[600~700(usec)]: 0
[700~800(usec)]: 0
[800~900(usec)]: 0
[900~1000(usec)]: 0
[over_ms]: 0
[over__s]: 0
----lower----
[0~100(usec)]: 0
[100~200(usec)]: 0
[200~300(usec)]: 0
[300~400(usec)]: 0
[400~500(usec)]: 0
[500~600(usec)]: 0
[600~700(usec)]: 0
[700~800(usec)]: 0
[800~900(usec)]: 0
[900~1000(usec)]: 0
[over_ms]: 0
[over__s]: 0
----average----
[avg_algo]: 0.0
[avg_low]: 0.0
-----lower_info----
[write_op]: 0
[read_op]: 0
[trim_op]:0
[WAF, RAF]: 0.000000, 0.000000
[if rw test]: 0.000000(WAF), 0.000000(RAF)
[all write Time]:0.0
[all read Time]:0.0

----summary----
[all_time]: 0.0
[size]: 77429.601562(mb)
[FAIL NUM] 0
[SUCCESS RATIO] 1.000000
[throughput] inf(kb/s)
             inf(mb/s)
[cache hit cnt,ratio] 8157714, 6.787461
[cache hit cnt,ratio dftl] 8157714, 0.823100
[READ WRITE CNT] 1201880 8709081
error cnt:114
result of ms:
---
bye bye!
# of gc: 29
# of translation page gc: 29
# of data page gc: 0
# of translation page gc w/ data page gc: 0
# of translation page gc w/ read op: 0
# of evict: 877821
# of buf hit: 3
!!! print info !!!
BH: buffer hit, H: hit, R: read, MC: memcpy, CE: clean eviction, DE: dirty eviction, GC: garbage collection
a_type--->>> 0: BH, 1: H
2: R & MC, 3: R & CE & MC
4: R & DE & MC, 5: R & CE & GC & MC
6: R & DE & GC & MC
!!! print info !!!
Cache hit on read: 813816
Cache miss on read: 388066
Cache hit on write: 7343898
Cache miss on write: 398566

Clean hit on read: 630306
Dirty hit on read: 210682
Clean hit on write: 92213
Dirty hit on write: 7251685

% of miss : 0.09
# Clean eviction: 387554
# Dirty eviction: 490267

Clean eviciton on read: 387554
Dirty eviction on read: 0
Clean eviction on write: 0
Dirty eviction on write: 490267

Dirty eviction ratio: 55.85%
Dirty eviction ratio on read: 0.00%
Dirty eviction ratio on write: 100.00%

WAF: 1.41

0 29
1 783693
2 490267
3 2035
4 2035
5 1201877
6 7742464
7 0
8 0
bdbm_mt max: 0
nohost: Wait for all the on-going jobs to finish...
nohost: [dm_nohost_close] MAP Download from HW!
nohost: [dm_nohost_close] closed!
write_q_hit:309154	read_q_hit:3	retry_hit:0